Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports
The Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports class imports all native functions related to picker.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.InvokeObjectPick(Tekla.Structures.ModelInternal.dotUIPicker_t)
Invokes the picker.
picker: The configuration of the picker.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.GetPickedObjects(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t@)
Gets the picked objects.
pickedObjects: The picked objects.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.GetPickerCommand(Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData@)
Gets the currently active picker command.
pickerCommand: The active picker command.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.GetToleratedPickedPoint(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t@)
Gets the currently tolerated picked point.
pickedPoint: The picked point.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.SetToleratedPickedPoint(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t)
Sets the currently tolerated picked point.
pickedPoint: The picked point.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.DotExportUIObjectPick(Tekla.Structures.ModelInternal.dotUIPicker_t@)
Invokes the picker.
dotPicker: The arguments indicating the required picker configuration.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.DotExportGetPickedObjects(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t@)
Exports the get picker data command.
dotPickedObjects: The picker data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.DotExportGetPickerCommand(Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData@)
Exports the function to get the name of the active picker command.
dotPickerCommand: The picker command name.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.DotExportGetToleratedPickedPoint(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t@)
Gets the current snapped point.
dotPickedPoint: The snapped point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.PickerHandlerImports.DotExportSetToleratedPickedPoint(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t@)
Overrides the current snapped point and hit type.
dotPickedPoint: The snapped point.
Returns: Greater than 0 on success.